In [1]:
# Label Encoding & Binary Encoding
# Bir değişkenin iki sınıfı varsa ve 0-1 olarak kodlanırsa buna binary encoding denir.
# Bir kategorik değişken label encoder'a sokulursa ve ikiden fazla sınıfı varsa bu durumda label encoding yapılmış olur.

In [47]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
#!pip install missingno
#import missingno as msno
from datetime import date
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split
from sklearn.neighbors import LocalOutlierFactor
from sklearn.preprocessing import MinMaxScaler, LabelEncoder,StandardScaler,RobustScaler

def grab_col_names(df,cat_th=10,car_th=20):
    cat_cols = [col for col in df.columns if df[col].dtypes == "O"]
    num_but_cat = [col for col in df.columns if df[col].nunique() < cat_th and df[col].dtypes != "O"]
    cat_but_car = [col for col in df.columns if df[col].nunique() > cat_th and df[col].dtypes == "O"]
    cat_cols = cat_cols + num_but_cat
    cat_cols = [col for col in cat_cols if col not in cat_but_car]
    
    #numumerik
    num_cols = [col for col in df.columns if df[col].dtypes != "O"]
    num_cols = [col for col in num_cols if col not in num_but_cat]
    
    print(f"Observations: {df.shape[0]}")
    print(f"Variables: {df.shape[1]}")
    print(f"cat_cols: {len(cat_cols)}") # Kategorik
    print(f"num_cols: {len(num_cols)}") # Numerik
    print(f"cat_but_car: {len(cat_but_car)}") # Kategorik ama kardinal
    print(f"num_but_cat: {len(num_but_cat)}")
    return cat_cols, num_cols, cat_but_car

def load():
    data = pd.read_csv("titanic.csv")
    return data

In [4]:
df = load()
df["Sex"].head()

0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object

In [5]:
# Değerler dönüştürülüyor. Alfabetik şekilde ilk değere 0 verir.
le = LabelEncoder()
le.fit_transform(df["Sex"])[0:5]

array([1, 0, 0, 0, 1])

In [6]:
# Bu 0-1'ler nedir.
le.inverse_transform([0,1])

array(['female', 'male'], dtype=object)

In [7]:
def label_encoder(df,binary_col):
    labelencoder = LabelEncoder()
    df[binary_col] = labelencoder.fit_transform(df[binary_col])
    return df

In [8]:
df = load()

In [9]:
#Değişkenin tipi int ya da float değilse ve eşsiz 2 ise onu seç
binary_cols = [col for col in df.columns if df[col].dtype not in [int,float] and df[col].nunique() == 2]

In [12]:
for col in binary_cols:
    label_encoder(df,col)

In [14]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S

In [25]:
df = pd.read_csv("application_train.csv")
df.shape

(307511, 122)

In [26]:
binary_cols = [col for col in df.columns if df[col].dtype not in [int,float] and df[col].nunique() == 2]

In [28]:
df[binary_cols].head()

,TARGET,NAME_CONTRACT_TYPE,FLAG_OWN_CAR,FLAG_OWN_REALTY,FLAG_MOBIL,FLAG_EMP_PHONE,FLAG_WORK_PHONE,FLAG_CONT_MOBILE,FLAG_PHONE,FLAG_EMAIL,...,FLAG_DOCUMENT_12,FLAG_DOCUMENT_13,FLAG_DOCUMENT_14,FLAG_DOCUMENT_15,FLAG_DOCUMENT_16,FLAG_DOCUMENT_17,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21
0,1,Cash loans,N,Y,1,1,0,1,1,0,...,0,0,0,0,0,0,0,0,0,0
1,0,Cash loans,N,N,1,1,0,1,1,0,...,0,0,0,0,0,0,0,0,0,0
2,0,Revolving loans,Y,Y,1,1,1,1,1,0,...,0,0,0,0,0,0,0,0,0,0
3,0,Cash loans,N,Y,1,1,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,Cash loans,N,Y,1,1,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0

In [29]:
for col in binary_cols:
    label_encoder(df,col)

In [32]:
df = pd.read_csv("titanic.csv")

In [35]:
# n/a eşsiz değerleri alırken n/a yı da alıyor
df["Embarked"].unique()
#len(df["Embarked"].unique())

4

In [ ]:
# ------------------------------------------------------------------------------ #

In [36]:
# One Hot Encoding
# Kategorik verileri sayısal verilere dönüştürmek için kullanılan bir kodlama tekniğidir.

In [38]:
df = load()
df["Embarked"].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [42]:
# İlk sınıftan(C) kurtularak 0 1 lere ayırdık.
pd.get_dummies(df,columns=["Embarked"], drop_first=True).head()
# Eksikleri bir sınıf gibi görmek istersek.
# pd.get_dummies(df,columns=["Embarked"], dummy_na=True).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,0,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,0,1

In [43]:
# Cinsiyeti de ayırdık.
pd.get_dummies(df,columns=["Sex"], drop_first=True).head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_male
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,S,1

In [45]:
# get_dummies methodu kullanarak hem label encoding işlemini (2 sınıflı değişken) hem de one-hot encoding işlemini yapabiliriz.
# Eğer bir değişkenin sınıf sayısı 2 ise drop_first'ü True yaptığımda direkt zaten o değişken binary encode ediliyor.
pd.get_dummies(df,columns=["Sex","Embarked"], drop_first=True).head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Sex_male,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,NaN,1,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,C85,0,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,C123,0,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,NaN,1,0,1

In [46]:
def one_hot_encoder(df,categorical_cols,drop_first=True):
    df = pd.get_dummies(df,columns= categorical_cols, drop_first=drop_first)
    return df

In [51]:
# cat_cols, num_cols, cat_but_car = grab_col_names(df)

# Cinsiyet ve Survivedden kurtuldum, 2 sınıflılar zaten
ohe_cols = [col for col in df.columns if 10 >= df[col].nunique() > 2]
ohe_cols

['Pclass', 'SibSp', 'Parch', 'Embarked']

In [52]:
one_hot_encoder(df,ohe_cols).head()

,PassengerId,Survived,Name,Sex,Age,Ticket,Fare,Cabin,Pclass_2,Pclass_3,...,SibSp_5,SibSp_8,Parch_1,Parch_2,Parch_3,Parch_4,Parch_5,Parch_6,Embarked_Q,Embarked_S
0,1,0,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,0,1,...,0,0,0,0,0,0,0,0,0,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,0,0,...,0,0,0,0,0,0,0,0,0,0
2,3,1,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,0,1,...,0,0,0,0,0,0,0,0,0,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,C123,0,0,...,0,0,0,0,0,0,0,0,0,1
4,5,0,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,0,1,...,0,0,0,0,0,0,0,0,0,1

In [53]:
# ------------------------------------------------------------------------------ #

In [ ]:
# ------------------------------------------------------------------------------ #

In [54]:
# Rare Encoding -> Bonus, Orta-İleri
# Nadir görülen kategorik değerleri daha genel bir kategori altında gruplar.

In [55]:
# 1- Kategorik değişkenlerin azlık çokluk durumu analizi
df = pd.read_csv("application_train.csv")

In [56]:
df["NAME_EDUCATION_TYPE"].value_counts()

Secondary / secondary special    218391
Higher education                  74863
Incomplete higher                 10277
Lower secondary                    3816
Academic degree                     164
Name: NAME_EDUCATION_TYPE, dtype: int64

In [57]:
cat_cols, num_cols, cat_but_car = grab_col_names(df)

Observations: 307511
Variables: 122
cat_cols: 53
num_cols: 67
cat_but_car: 2
num_but_cat: 39

In [59]:
# Kategorik değişkenlerin kendi içinde dağılımlarını gördük.
def cat_summary(df,col_name,plot=False):
    print(pd.DataFrame({col_name:df[col_name].value_counts(), # Değişkenin ismi ve oranları
                       "Ratio":100*df[col_name].value_counts() / len(df)}))
    
    print("#############################")
    
    if plot:
        sns.countplot(x=df[col_name],data=df)
        plt.show()

In [60]:
# Bütün kategorik değişkenler geldi.
for col in cat_cols:
    cat_summary(df,col)

                 NAME_CONTRACT_TYPE      Ratio
Cash loans                   278232  90.478715
Revolving loans               29279   9.521285
#############################
     CODE_GENDER      Ratio
F         202448  65.834393
M         105059  34.164306
XNA            4   0.001301
#############################
   FLAG_OWN_CAR      Ratio
N        202924  65.989184
Y        104587  34.010816
#############################
   FLAG_OWN_REALTY      Ratio
Y           213312  69.367275
N            94199  30.632725
#############################
                 NAME_TYPE_SUITE      Ratio
Unaccompanied             248526  80.818572
Family                     40149  13.056118
Spouse, partner            11370   3.697429
Children                    3267   1.062401
Other_B                     1770   0.575589
Other_A                      866   0.281616
Group of people              271   0.088127
#############################
                      NAME_INCOME_TYPE      Ratio
Working                         158774  51.631974
Commercial associate             71617  23.289248
Pensioner                        55362  18.003258
State servant                    21703   7.057634
Unemployed                          22   0.007154
Student                             18   0.005853
Businessman                         10   0.003252
Maternity leave                      5   0.001626
#############################
                               NAME_EDUCATION_TYPE      Ratio
Secondary / secondary special               218391  71.018923
Higher education                             74863  24.344820
Incomplete higher                            10277   3.341994
Lower secondary                               3816   1.240931
Academic degree                                164   0.053331
#############################
                      NAME_FAMILY_STATUS      Ratio
Married                           196432  63.878040
Single / not married               45444  14.778008
Civil marriage                     29775   9.682580
Separated                          19770   6.429038
Widow                              16088   5.231683
Unknown                                2   0.000650
#############################
                     NAME_HOUSING_TYPE      Ratio
House / apartment               272868  88.734387
With parents                     14840   4.825844
Municipal apartment              11183   3.636618
Rented apartment                  4881   1.587260
Office apartment                  2617   0.851026
Co-op apartment                   1122   0.364865
#############################
           WEEKDAY_APPR_PROCESS_START      Ratio
TUESDAY                         53901  17.528153
WEDNESDAY                       51934  16.888502
MONDAY                          50714  16.491768
THURSDAY                        50591  16.451769
FRIDAY                          50338  16.369496
SATURDAY                        33852  11.008387
SUNDAY                          16181   5.261926
#############################
                       FONDKAPREMONT_MODE      Ratio
reg oper account                    73830  24.008897
reg oper spec account               12080   3.928315
not specified                        5687   1.849365
org spec account                     5619   1.827252
#############################
                  HOUSETYPE_MODE      Ratio
block of flats            150503  48.942314
specific housing            1499   0.487462
terraced house              1212   0.394132
#############################
              WALLSMATERIAL_MODE      Ratio
Panel                      66040  21.475655
Stone, brick               64815  21.077295
Block                       9253   3.008998
Wooden                      5362   1.743677
Mixed                       2296   0.746640
Monolithic                  1779   0.578516
Others                      1625   0.528436
#############################
     EMERGENCYSTATE_MODE      Ratio
No                159428  51.844649
Yes                 2328   0.757046
#############################
   TARGET      Ratio
0  282686  91.927118
1   24825   8.072882
#############################
   FLAG_MOBIL      Ratio
1      307510  99.999675
0           1   0.000325
#############################
   FLAG_EMP_PHONE      Ratio
1          252125  81.988937
0           55386  18.011063
#############################
   FLAG_WORK_PHONE      Ratio
0           246203  80.063152
1            61308  19.936848
#############################
   FLAG_CONT_MOBILE     Ratio
1            306937  99.81334
0               574   0.18666
#############################
   FLAG_PHONE      Ratio
0      221080  71.893363
1       86431  28.106637
#############################
   FLAG_EMAIL      Ratio
0      290069  94.328008
1       17442   5.671992
#############################
   REGION_RATING_CLIENT      Ratio
2                226984  73.813294
3                 48330  15.716511
1                 32197  10.470195
#############################
   REGION_RATING_CLIENT_W_CITY      Ratio
2                       229484  74.626274
3                        43860  14.262904
1                        34167  11.110822
#############################
   REG_REGION_NOT_LIVE_REGION      Ratio
0                      302854  98.485583
1                        4657   1.514417
#############################
   REG_REGION_NOT_WORK_REGION      Ratio
0                      291899  94.923108
1                       15612   5.076892
#############################
   LIVE_REGION_NOT_WORK_REGION      Ratio
0                       295008  95.934129
1                        12503   4.065871
#############################
   REG_CITY_NOT_LIVE_CITY      Ratio
0                  283472  92.182719
1                   24039   7.817281
#############################
   REG_CITY_NOT_WORK_CITY      Ratio
0                  236644  76.954646
1                   70867  23.045354
#############################
   LIVE_CITY_NOT_WORK_CITY      Ratio
0                   252296  82.044545
1                    55215  17.955455
#############################
      DEF_60_CNT_SOCIAL_CIRCLE      Ratio
0.0                     280721  91.288117
1.0                      21841   7.102510
2.0                       3170   1.030857
3.0                        598   0.194465
4.0                        135   0.043901
5.0                         20   0.006504
6.0                          3   0.000976
7.0                          1   0.000325
24.0                         1   0.000325
#############################
   FLAG_DOCUMENT_2      Ratio
0           307498  99.995773
1               13   0.004227
#############################
   FLAG_DOCUMENT_3      Ratio
1           218340  71.002338
0            89171  28.997662
#############################
   FLAG_DOCUMENT_4     Ratio
0           307486  99.99187
1               25   0.00813
#############################
   FLAG_DOCUMENT_5      Ratio
0           302863  98.488509
1             4648   1.511491
#############################
   FLAG_DOCUMENT_6      Ratio
0           280433  91.194461
1            27078   8.805539
#############################
   FLAG_DOCUMENT_7      Ratio
0           307452  99.980814
1               59   0.019186
#############################
   FLAG_DOCUMENT_8      Ratio
0           282487  91.862405
1            25024   8.137595
#############################
   FLAG_DOCUMENT_9     Ratio
0           306313  99.61042
1             1198   0.38958
#############################
   FLAG_DOCUMENT_10      Ratio
0            307504  99.997724
1                 7   0.002276
#############################
   FLAG_DOCUMENT_11      Ratio
0            306308  99.608794
1              1203   0.391206
#############################
   FLAG_DOCUMENT_12     Ratio
0            307509  99.99935
1                 2   0.00065
#############################
   FLAG_DOCUMENT_13      Ratio
0            306427  99.647492
1              1084   0.352508
#############################
   FLAG_DOCUMENT_14      Ratio
0            306608  99.706352
1               903   0.293648
#############################
   FLAG_DOCUMENT_15      Ratio
0            307139  99.879029
1               372   0.120971
#############################
   FLAG_DOCUMENT_16     Ratio
0            304458  99.00719
1              3053   0.99281
#############################
   FLAG_DOCUMENT_17      Ratio
0            307429  99.973334
1                82   0.026666
#############################
   FLAG_DOCUMENT_18      Ratio
0            305011  99.187021
1              2500   0.812979
#############################
   FLAG_DOCUMENT_19     Ratio
0            307328  99.94049
1               183   0.05951
#############################
   FLAG_DOCUMENT_20     Ratio
0            307355  99.94927
1               156   0.05073
#############################
   FLAG_DOCUMENT_21      Ratio
0            307408  99.966505
1               103   0.033495
#############################
     AMT_REQ_CREDIT_BUREAU_HOUR      Ratio
0.0                      264366  85.969608
1.0                        1560   0.507299
2.0                          56   0.018211
3.0                           9   0.002927
4.0                           1   0.000325
#############################
     AMT_REQ_CREDIT_BUREAU_DAY      Ratio
0.0                     264503  86.014159
1.0                       1292   0.420148
2.0                        106   0.034470
3.0                         45   0.014634
4.0                         26   0.008455
5.0                          9   0.002927
6.0                          8   0.002602
9.0                          2   0.000650
8.0                          1   0.000325
#############################
     AMT_REQ_CREDIT_BUREAU_WEEK      Ratio
0.0                      257456  83.722534
1.0                        8208   2.669173
2.0                         199   0.064713
3.0                          58   0.018861
4.0                          34   0.011057
6.0                          20   0.006504
5.0                          10   0.003252
8.0                           5   0.001626
7.0                           2   0.000650
#############################

In [62]:
# 2- Rare kategoriler ile bağımlı değişken arasındaki ilişkinin analizi

# Target tarafından bakıyoruz.
df.groupby("NAME_INCOME_TYPE")["TARGET"].mean()

NAME_INCOME_TYPE
Businessman             0.000000
Commercial associate    0.074843
Maternity leave         0.400000
Pensioner               0.053864
State servant           0.057550
Student                 0.000000
Unemployed              0.363636
Working                 0.095885
Name: TARGET, dtype: float64

In [68]:
# Yukarıdaki iki işlemi birleştirdik.
def rare_analyser(df,target,cat_cols):
    for col in cat_cols:
        print(col,":",len(df[col].value_counts())) # Kaç sınıfı var bilgisi
        
        print(pd.DataFrame({"COUNT": df[col].value_counts(), # sınıf frekansları
                            "RATIO": df[col].value_counts() / len(df), # Sınıf oranları
                            "TARGET_MEAN": df.groupby(col)[target].mean()}),end="\n\n\n") # Bağımlı değişkene göre grup işlemi

In [69]:
# Bütün kategorik sınıflar için rare işlemi gerçekleştirdim.
rare_analyser(df,"TARGET",cat_cols)

NAME_CONTRACT_TYPE : 2
                  COUNT     RATIO  TARGET_MEAN
Cash loans       278232  0.904787     0.083459
Revolving loans   29279  0.095213     0.054783


CODE_GENDER : 3
      COUNT     RATIO  TARGET_MEAN
F    202448  0.658344     0.069993
M    105059  0.341643     0.101419
XNA       4  0.000013     0.000000


FLAG_OWN_CAR : 2
    COUNT     RATIO  TARGET_MEAN
N  202924  0.659892     0.085002
Y  104587  0.340108     0.072437


FLAG_OWN_REALTY : 2
    COUNT     RATIO  TARGET_MEAN
N   94199  0.306327     0.083249
Y  213312  0.693673     0.079616


NAME_TYPE_SUITE : 7
                  COUNT     RATIO  TARGET_MEAN
Children           3267  0.010624     0.073768
Family            40149  0.130561     0.074946
Group of people     271  0.000881     0.084871
Other_A             866  0.002816     0.087760
Other_B            1770  0.005756     0.098305
Spouse, partner   11370  0.036974     0.078716
Unaccompanied    248526  0.808186     0.081830


NAME_INCOME_TYPE : 8
                       COUNT     RATIO  TARGET_MEAN
Businessman               10  0.000033     0.000000
Commercial associate   71617  0.232892     0.074843
Maternity leave            5  0.000016     0.400000
Pensioner              55362  0.180033     0.053864
State servant          21703  0.070576     0.057550
Student                   18  0.000059     0.000000
Unemployed                22  0.000072     0.363636
Working               158774  0.516320     0.095885


NAME_EDUCATION_TYPE : 5
                                COUNT     RATIO  TARGET_MEAN
Academic degree                   164  0.000533     0.018293
Higher education                74863  0.243448     0.053551
Incomplete higher               10277  0.033420     0.084850
Lower secondary                  3816  0.012409     0.109277
Secondary / secondary special  218391  0.710189     0.089399


NAME_FAMILY_STATUS : 6
                       COUNT     RATIO  TARGET_MEAN
Civil marriage         29775  0.096826     0.099446
Married               196432  0.638780     0.075599
Separated              19770  0.064290     0.081942
Single / not married   45444  0.147780     0.098077
Unknown                    2  0.000007     0.000000
Widow                  16088  0.052317     0.058242


NAME_HOUSING_TYPE : 6
                      COUNT     RATIO  TARGET_MEAN
Co-op apartment        1122  0.003649     0.079323
House / apartment    272868  0.887344     0.077957
Municipal apartment   11183  0.036366     0.085397
Office apartment       2617  0.008510     0.065724
Rented apartment       4881  0.015873     0.123131
With parents          14840  0.048258     0.116981


WEEKDAY_APPR_PROCESS_START : 7
           COUNT     RATIO  TARGET_MEAN
FRIDAY     50338  0.163695     0.081469
MONDAY     50714  0.164918     0.077572
SATURDAY   33852  0.110084     0.078873
SUNDAY     16181  0.052619     0.079291
THURSDAY   50591  0.164518     0.081003
TUESDAY    53901  0.175282     0.083505
WEDNESDAY  51934  0.168885     0.081604


FONDKAPREMONT_MODE : 4
                       COUNT     RATIO  TARGET_MEAN
not specified           5687  0.018494     0.075435
org spec account        5619  0.018273     0.058195
reg oper account       73830  0.240089     0.069782
reg oper spec account  12080  0.039283     0.065563


HOUSETYPE_MODE : 3
                   COUNT     RATIO  TARGET_MEAN
block of flats    150503  0.489423     0.069434
specific housing    1499  0.004875     0.101401
terraced house      1212  0.003941     0.084983


WALLSMATERIAL_MODE : 7
              COUNT     RATIO  TARGET_MEAN
Block          9253  0.030090     0.070247
Mixed          2296  0.007466     0.075348
Monolithic     1779  0.005785     0.047218
Others         1625  0.005284     0.083077
Panel         66040  0.214757     0.063477
Stone, brick  64815  0.210773     0.074057
Wooden         5362  0.017437     0.096979


EMERGENCYSTATE_MODE : 2
      COUNT     RATIO  TARGET_MEAN
No   159428  0.518446     0.069649
Yes    2328  0.007570     0.095790


TARGET : 2
    COUNT     RATIO  TARGET_MEAN
0  282686  0.919271          0.0
1   24825  0.080729          1.0


FLAG_MOBIL : 2
    COUNT     RATIO  TARGET_MEAN
0       1  0.000003     0.000000
1  307510  0.999997     0.080729


FLAG_EMP_PHONE : 2
    COUNT     RATIO  TARGET_MEAN
0   55386  0.180111     0.054003
1  252125  0.819889     0.086600


FLAG_WORK_PHONE : 2
    COUNT     RATIO  TARGET_MEAN
0  246203  0.800632     0.076851
1   61308  0.199368     0.096301


FLAG_CONT_MOBILE : 2
    COUNT     RATIO  TARGET_MEAN
0     574  0.001867     0.078397
1  306937  0.998133     0.080733


FLAG_PHONE : 2
    COUNT     RATIO  TARGET_MEAN
0  221080  0.718934     0.084784
1   86431  0.281066     0.070357


FLAG_EMAIL : 2
    COUNT    RATIO  TARGET_MEAN
0  290069  0.94328     0.080846
1   17442  0.05672     0.078775


REGION_RATING_CLIENT : 3
    COUNT     RATIO  TARGET_MEAN
1   32197  0.104702     0.048203
2  226984  0.738133     0.078891
3   48330  0.157165     0.111028


REGION_RATING_CLIENT_W_CITY : 3
    COUNT     RATIO  TARGET_MEAN
1   34167  0.111108     0.048409
2  229484  0.746263     0.079178
3   43860  0.142629     0.114022


REG_REGION_NOT_LIVE_REGION : 2
    COUNT     RATIO  TARGET_MEAN
0  302854  0.984856     0.080540
1    4657  0.015144     0.092978


REG_REGION_NOT_WORK_REGION : 2
    COUNT     RATIO  TARGET_MEAN
0  291899  0.949231     0.080291
1   15612  0.050769     0.088906


LIVE_REGION_NOT_WORK_REGION : 2
    COUNT     RATIO  TARGET_MEAN
0  295008  0.959341     0.080571
1   12503  0.040659     0.084460


REG_CITY_NOT_LIVE_CITY : 2
    COUNT     RATIO  TARGET_MEAN
0  283472  0.921827     0.077207
1   24039  0.078173     0.122260


REG_CITY_NOT_WORK_CITY : 2
    COUNT     RATIO  TARGET_MEAN
0  236644  0.769546     0.073127
1   70867  0.230454     0.106114


LIVE_CITY_NOT_WORK_CITY : 2
    COUNT     RATIO  TARGET_MEAN
0  252296  0.820445     0.076585
1   55215  0.179555     0.099665


DEF_60_CNT_SOCIAL_CIRCLE : 9
       COUNT     RATIO  TARGET_MEAN
0.0   280721  0.912881     0.078348
1.0    21841  0.071025     0.105169
2.0     3170  0.010309     0.121451
3.0      598  0.001945     0.158863
4.0      135  0.000439     0.111111
5.0       20  0.000065     0.150000
6.0        3  0.000010     0.000000
7.0        1  0.000003     0.000000
24.0       1  0.000003     0.000000


FLAG_DOCUMENT_2 : 2
    COUNT     RATIO  TARGET_MEAN
0  307498  0.999958     0.080719
1      13  0.000042     0.307692


FLAG_DOCUMENT_3 : 2
    COUNT     RATIO  TARGET_MEAN
0   89171  0.289977     0.061825
1  218340  0.710023     0.088449


FLAG_DOCUMENT_4 : 2
    COUNT     RATIO  TARGET_MEAN
0  307486  0.999919     0.080735
1      25  0.000081     0.000000


FLAG_DOCUMENT_5 : 2
    COUNT     RATIO  TARGET_MEAN
0  302863  0.984885     0.080739
1    4648  0.015115     0.080034


FLAG_DOCUMENT_6 : 2
    COUNT     RATIO  TARGET_MEAN
0  280433  0.911945     0.083150
1   27078  0.088055     0.055654


FLAG_DOCUMENT_7 : 2
    COUNT     RATIO  TARGET_MEAN
0  307452  0.999808     0.080735
1      59  0.000192     0.050847


FLAG_DOCUMENT_8 : 2
    COUNT     RATIO  TARGET_MEAN
0  282487  0.918624     0.081381
1   25024  0.081376     0.073370


FLAG_DOCUMENT_9 : 2
    COUNT     RATIO  TARGET_MEAN
0  306313  0.996104     0.080803
1    1198  0.003896     0.061770


FLAG_DOCUMENT_10 : 2
    COUNT     RATIO  TARGET_MEAN
0  307504  0.999977     0.080731
1       7  0.000023     0.000000


FLAG_DOCUMENT_11 : 2
    COUNT     RATIO  TARGET_MEAN
0  306308  0.996088     0.080801
1    1203  0.003912     0.062344


FLAG_DOCUMENT_12 : 2
    COUNT     RATIO  TARGET_MEAN
0  307509  0.999993     0.080729
1       2  0.000007     0.000000


FLAG_DOCUMENT_13 : 2
    COUNT     RATIO  TARGET_MEAN
0  306427  0.996475     0.080916
1    1084  0.003525     0.027675


FLAG_DOCUMENT_14 : 2
    COUNT     RATIO  TARGET_MEAN
0  306608  0.997064     0.080869
1     903  0.002936     0.033223


FLAG_DOCUMENT_15 : 2
    COUNT    RATIO  TARGET_MEAN
0  307139  0.99879     0.080791
1     372  0.00121     0.029570


FLAG_DOCUMENT_16 : 2
    COUNT     RATIO  TARGET_MEAN
0  304458  0.990072     0.081046
1    3053  0.009928     0.049132


FLAG_DOCUMENT_17 : 2
    COUNT     RATIO  TARGET_MEAN
0  307429  0.999733     0.080744
1      82  0.000267     0.024390


FLAG_DOCUMENT_18 : 2
    COUNT    RATIO  TARGET_MEAN
0  305011  0.99187     0.080925
1    2500  0.00813     0.056800


FLAG_DOCUMENT_19 : 2
    COUNT     RATIO  TARGET_MEAN
0  307328  0.999405     0.080738
1     183  0.000595     0.065574


FLAG_DOCUMENT_20 : 2
    COUNT     RATIO  TARGET_MEAN
0  307355  0.999493     0.080727
1     156  0.000507     0.083333


FLAG_DOCUMENT_21 : 2
    COUNT     RATIO  TARGET_MEAN
0  307408  0.999665     0.080710
1     103  0.000335     0.135922


AMT_REQ_CREDIT_BUREAU_HOUR : 5
      COUNT     RATIO  TARGET_MEAN
0.0  264366  0.859696     0.077173
1.0    1560  0.005073     0.080128
2.0      56  0.000182     0.107143
3.0       9  0.000029     0.000000
4.0       1  0.000003     0.000000


AMT_REQ_CREDIT_BUREAU_DAY : 9
      COUNT     RATIO  TARGET_MEAN
0.0  264503  0.860142     0.077096
1.0    1292  0.004201     0.096749
2.0     106  0.000345     0.103774
3.0      45  0.000146     0.044444
4.0      26  0.000085     0.115385
5.0       9  0.000029     0.000000
6.0       8  0.000026     0.000000
8.0       1  0.000003     0.000000
9.0       2  0.000007     0.000000


AMT_REQ_CREDIT_BUREAU_WEEK : 9
      COUNT     RATIO  TARGET_MEAN
0.0  257456  0.837225     0.077159
1.0    8208  0.026692     0.077729
2.0     199  0.000647     0.100503
3.0      58  0.000189     0.068966
4.0      34  0.000111     0.117647
5.0      10  0.000033     0.100000
6.0      20  0.000065     0.050000
7.0       2  0.000007     0.000000
8.0       5  0.000016     0.000000

In [70]:
# Rare Encoder Yazılması
# Düşük oranları bir araya getireceğiz.

In [71]:
def rare_encoder(df,rare_perc):
    temp_df = df.copy()
    
    # Eğer fonksiyona girilen rare oranından daha düşük sayıda herhnagi bir bu kategorik değişkenin oranı varsa 
    # ve aynı zamanda bir kategorik değişken ise bunları getir.
    rare_columns = [col for col in temp_df.columns if temp_df[col].dtypes == "O"
                    and (temp_df[col].value_counts() / len(temp_df) < rare_perc).any(axis=None)]
    
    for var in rare_columns:
        tmp = temp_df[var].value_counts() / len(temp_df) # Sınıf oranları hesaplanmış
        rare_labels = tmp[tmp<rare_perc].index # Eşik değerden düşük sınıfa sahip olan değerler bu indexler
        temp_df[var] = np.where(temp_df[var].isin(rare_labels), "Rare",temp_df[var])
        
    return temp_df

In [72]:
new_df = rare_encoder(df,0.01)

In [74]:
rare_analyser(new_df,"TARGET",cat_cols)

NAME_CONTRACT_TYPE : 2
                  COUNT     RATIO  TARGET_MEAN
Cash loans       278232  0.904787     0.083459
Revolving loans   29279  0.095213     0.054783


CODE_GENDER : 3
       COUNT     RATIO  TARGET_MEAN
F     202448  0.658344     0.069993
M     105059  0.341643     0.101419
Rare       4  0.000013     0.000000


FLAG_OWN_CAR : 2
    COUNT     RATIO  TARGET_MEAN
N  202924  0.659892     0.085002
Y  104587  0.340108     0.072437


FLAG_OWN_REALTY : 2
    COUNT     RATIO  TARGET_MEAN
N   94199  0.306327     0.083249
Y  213312  0.693673     0.079616


NAME_TYPE_SUITE : 5
                  COUNT     RATIO  TARGET_MEAN
Children           3267  0.010624     0.073768
Family            40149  0.130561     0.074946
Rare               2907  0.009453     0.093911
Spouse, partner   11370  0.036974     0.078716
Unaccompanied    248526  0.808186     0.081830


NAME_INCOME_TYPE : 5
                       COUNT     RATIO  TARGET_MEAN
Commercial associate   71617  0.232892     0.074843
Pensioner              55362  0.180033     0.053864
Rare                      55  0.000179     0.181818
State servant          21703  0.070576     0.057550
Working               158774  0.516320     0.095885


NAME_EDUCATION_TYPE : 5
                                COUNT     RATIO  TARGET_MEAN
Higher education                74863  0.243448     0.053551
Incomplete higher               10277  0.033420     0.084850
Lower secondary                  3816  0.012409     0.109277
Rare                              164  0.000533     0.018293
Secondary / secondary special  218391  0.710189     0.089399


NAME_FAMILY_STATUS : 6
                       COUNT     RATIO  TARGET_MEAN
Civil marriage         29775  0.096826     0.099446
Married               196432  0.638780     0.075599
Rare                       2  0.000007     0.000000
Separated              19770  0.064290     0.081942
Single / not married   45444  0.147780     0.098077
Widow                  16088  0.052317     0.058242


NAME_HOUSING_TYPE : 5
                      COUNT     RATIO  TARGET_MEAN
House / apartment    272868  0.887344     0.077957
Municipal apartment   11183  0.036366     0.085397
Rare                   3739  0.012159     0.069805
Rented apartment       4881  0.015873     0.123131
With parents          14840  0.048258     0.116981


WEEKDAY_APPR_PROCESS_START : 7
           COUNT     RATIO  TARGET_MEAN
FRIDAY     50338  0.163695     0.081469
MONDAY     50714  0.164918     0.077572
SATURDAY   33852  0.110084     0.078873
SUNDAY     16181  0.052619     0.079291
THURSDAY   50591  0.164518     0.081003
TUESDAY    53901  0.175282     0.083505
WEDNESDAY  51934  0.168885     0.081604


FONDKAPREMONT_MODE : 4
                       COUNT     RATIO  TARGET_MEAN
not specified           5687  0.018494     0.075435
org spec account        5619  0.018273     0.058195
reg oper account       73830  0.240089     0.069782
reg oper spec account  12080  0.039283     0.065563


HOUSETYPE_MODE : 2
                 COUNT     RATIO  TARGET_MEAN
Rare              2711  0.008816     0.094061
block of flats  150503  0.489423     0.069434


WALLSMATERIAL_MODE : 5
              COUNT     RATIO  TARGET_MEAN
Block          9253  0.030090     0.070247
Panel         66040  0.214757     0.063477
Rare           5700  0.018536     0.068772
Stone, brick  64815  0.210773     0.074057
Wooden         5362  0.017437     0.096979


EMERGENCYSTATE_MODE : 2
       COUNT     RATIO  TARGET_MEAN
No    159428  0.518446     0.069649
Rare    2328  0.007570     0.095790


TARGET : 2
    COUNT     RATIO  TARGET_MEAN
0  282686  0.919271          0.0
1   24825  0.080729          1.0


FLAG_MOBIL : 2
    COUNT     RATIO  TARGET_MEAN
0       1  0.000003     0.000000
1  307510  0.999997     0.080729


FLAG_EMP_PHONE : 2
    COUNT     RATIO  TARGET_MEAN
0   55386  0.180111     0.054003
1  252125  0.819889     0.086600


FLAG_WORK_PHONE : 2
    COUNT     RATIO  TARGET_MEAN
0  246203  0.800632     0.076851
1   61308  0.199368     0.096301


FLAG_CONT_MOBILE : 2
    COUNT     RATIO  TARGET_MEAN
0     574  0.001867     0.078397
1  306937  0.998133     0.080733


FLAG_PHONE : 2
    COUNT     RATIO  TARGET_MEAN
0  221080  0.718934     0.084784
1   86431  0.281066     0.070357


FLAG_EMAIL : 2
    COUNT    RATIO  TARGET_MEAN
0  290069  0.94328     0.080846
1   17442  0.05672     0.078775


REGION_RATING_CLIENT : 3
    COUNT     RATIO  TARGET_MEAN
1   32197  0.104702     0.048203
2  226984  0.738133     0.078891
3   48330  0.157165     0.111028


REGION_RATING_CLIENT_W_CITY : 3
    COUNT     RATIO  TARGET_MEAN
1   34167  0.111108     0.048409
2  229484  0.746263     0.079178
3   43860  0.142629     0.114022


REG_REGION_NOT_LIVE_REGION : 2
    COUNT     RATIO  TARGET_MEAN
0  302854  0.984856     0.080540
1    4657  0.015144     0.092978


REG_REGION_NOT_WORK_REGION : 2
    COUNT     RATIO  TARGET_MEAN
0  291899  0.949231     0.080291
1   15612  0.050769     0.088906


LIVE_REGION_NOT_WORK_REGION : 2
    COUNT     RATIO  TARGET_MEAN
0  295008  0.959341     0.080571
1   12503  0.040659     0.084460


REG_CITY_NOT_LIVE_CITY : 2
    COUNT     RATIO  TARGET_MEAN
0  283472  0.921827     0.077207
1   24039  0.078173     0.122260


REG_CITY_NOT_WORK_CITY : 2
    COUNT     RATIO  TARGET_MEAN
0  236644  0.769546     0.073127
1   70867  0.230454     0.106114


LIVE_CITY_NOT_WORK_CITY : 2
    COUNT     RATIO  TARGET_MEAN
0  252296  0.820445     0.076585
1   55215  0.179555     0.099665


DEF_60_CNT_SOCIAL_CIRCLE : 9
       COUNT     RATIO  TARGET_MEAN
0.0   280721  0.912881     0.078348
1.0    21841  0.071025     0.105169
2.0     3170  0.010309     0.121451
3.0      598  0.001945     0.158863
4.0      135  0.000439     0.111111
5.0       20  0.000065     0.150000
6.0        3  0.000010     0.000000
7.0        1  0.000003     0.000000
24.0       1  0.000003     0.000000


FLAG_DOCUMENT_2 : 2
    COUNT     RATIO  TARGET_MEAN
0  307498  0.999958     0.080719
1      13  0.000042     0.307692


FLAG_DOCUMENT_3 : 2
    COUNT     RATIO  TARGET_MEAN
0   89171  0.289977     0.061825
1  218340  0.710023     0.088449


FLAG_DOCUMENT_4 : 2
    COUNT     RATIO  TARGET_MEAN
0  307486  0.999919     0.080735
1      25  0.000081     0.000000


FLAG_DOCUMENT_5 : 2
    COUNT     RATIO  TARGET_MEAN
0  302863  0.984885     0.080739
1    4648  0.015115     0.080034


FLAG_DOCUMENT_6 : 2
    COUNT     RATIO  TARGET_MEAN
0  280433  0.911945     0.083150
1   27078  0.088055     0.055654


FLAG_DOCUMENT_7 : 2
    COUNT     RATIO  TARGET_MEAN
0  307452  0.999808     0.080735
1      59  0.000192     0.050847


FLAG_DOCUMENT_8 : 2
    COUNT     RATIO  TARGET_MEAN
0  282487  0.918624     0.081381
1   25024  0.081376     0.073370


FLAG_DOCUMENT_9 : 2
    COUNT     RATIO  TARGET_MEAN
0  306313  0.996104     0.080803
1    1198  0.003896     0.061770


FLAG_DOCUMENT_10 : 2
    COUNT     RATIO  TARGET_MEAN
0  307504  0.999977     0.080731
1       7  0.000023     0.000000


FLAG_DOCUMENT_11 : 2
    COUNT     RATIO  TARGET_MEAN
0  306308  0.996088     0.080801
1    1203  0.003912     0.062344


FLAG_DOCUMENT_12 : 2
    COUNT     RATIO  TARGET_MEAN
0  307509  0.999993     0.080729
1       2  0.000007     0.000000


FLAG_DOCUMENT_13 : 2
    COUNT     RATIO  TARGET_MEAN
0  306427  0.996475     0.080916
1    1084  0.003525     0.027675


FLAG_DOCUMENT_14 : 2
    COUNT     RATIO  TARGET_MEAN
0  306608  0.997064     0.080869
1     903  0.002936     0.033223


FLAG_DOCUMENT_15 : 2
    COUNT    RATIO  TARGET_MEAN
0  307139  0.99879     0.080791
1     372  0.00121     0.029570


FLAG_DOCUMENT_16 : 2
    COUNT     RATIO  TARGET_MEAN
0  304458  0.990072     0.081046
1    3053  0.009928     0.049132


FLAG_DOCUMENT_17 : 2
    COUNT     RATIO  TARGET_MEAN
0  307429  0.999733     0.080744
1      82  0.000267     0.024390


FLAG_DOCUMENT_18 : 2
    COUNT    RATIO  TARGET_MEAN
0  305011  0.99187     0.080925
1    2500  0.00813     0.056800


FLAG_DOCUMENT_19 : 2
    COUNT     RATIO  TARGET_MEAN
0  307328  0.999405     0.080738
1     183  0.000595     0.065574


FLAG_DOCUMENT_20 : 2
    COUNT     RATIO  TARGET_MEAN
0  307355  0.999493     0.080727
1     156  0.000507     0.083333


FLAG_DOCUMENT_21 : 2
    COUNT     RATIO  TARGET_MEAN
0  307408  0.999665     0.080710
1     103  0.000335     0.135922


AMT_REQ_CREDIT_BUREAU_HOUR : 5
      COUNT     RATIO  TARGET_MEAN
0.0  264366  0.859696     0.077173
1.0    1560  0.005073     0.080128
2.0      56  0.000182     0.107143
3.0       9  0.000029     0.000000
4.0       1  0.000003     0.000000


AMT_REQ_CREDIT_BUREAU_DAY : 9
      COUNT     RATIO  TARGET_MEAN
0.0  264503  0.860142     0.077096
1.0    1292  0.004201     0.096749
2.0     106  0.000345     0.103774
3.0      45  0.000146     0.044444
4.0      26  0.000085     0.115385
5.0       9  0.000029     0.000000
6.0       8  0.000026     0.000000
8.0       1  0.000003     0.000000
9.0       2  0.000007     0.000000


AMT_REQ_CREDIT_BUREAU_WEEK : 9
      COUNT     RATIO  TARGET_MEAN
0.0  257456  0.837225     0.077159
1.0    8208  0.026692     0.077729
2.0     199  0.000647     0.100503
3.0      58  0.000189     0.068966
4.0      34  0.000111     0.117647
5.0      10  0.000033     0.100000
6.0      20  0.000065     0.050000
7.0       2  0.000007     0.000000
8.0       5  0.000016     0.000000